{
    "notebooks": [
        {
            "id": 1,
            "name": "默认笔记本"
        },
        {
            "id": 2,
            "name": "我的2019"
        },
        {
            "id": 3,
            "name": "我的2020"
        }
    ],
    "notes": [
        {
            "id": 1,
            "title": "这是一段代码",
            "content": "## 一段react的示例代码\n## 安装react\n```\nnpm install react --save-dev\nnpm install react-dowm --save-dev\n```\n### JS部分\n```\n// 引入react\nimport React from \"react\";\nimport ReactDOM from \"react-dom\";\n// 定义函数组件\nfunction App() {\n   return (<h1>hello react !</h1>)\n}\n// 渲染组件到根节点\nReactDOM.render(<App/>, document.getElementById(\"root\"));\n```\n\n### html部分\n```\n<!DOCTYPE html>\n<html lang=\"en\">\n  <head></head>\n  <div id=\"root\">\n  </div>\n</html>\n```",
            "bookId": 1
        },
        {
            "id": 2,
            "title": "2019好笑的笑话 最好能笑死别人",
            "content": "## 第一个\n> 朋友去唱歌找了小姐，买单时发现没有现金只有银行卡，服务员说：“可以刷卡。”他说：“这卡是我老婆名字，刷了收到你们KTV短信，会打死我的。”服务员说：“没事，我们可以帮你刷成饭店消费。”此男一听很开心然后就刷了…结果刚一进家门老婆劈里啪啦两个大耳光，把手机短信给他看：“沙县小吃，消费8333元，你没有撑死？”\n\n## 第二个\n> 有一次，一个男人准备去办公室工作，他听说来了很多美女，就把自己打扮得漂漂亮亮，到了办公室，美女们都对男人微笑，他认为美女觉得自己很帅，其实，他的牙上沾了一颗红的和一颗绿的辣椒皮！\n\n## 第三个\n> 女婿跟老丈人抱怨，我老婆开着80多W的车，穿着几千的衣服， 用着苹果X，我天天电动车，一年四季2件外衣，用着淘汰的老年机，你知道我多惨吗？ 只见老丈人神色淡定的说道：你天天睡着个开80多万的车，穿着几千块衣服，手拿苹果X的女人，还有什么不满意的！\n\n## 第四个\n> 前几天哥几个晚上去网吧玩，凌晨三点多回家，都离家比较近走着回去的，走到一半一哥们在路边冲着一棵树小解，我们走前面，他解完就追上我们，然后我说 你尿尿的姿势不对呀！哥们一脸懵逼，问我:怎么不对了？我:你应该抬起一条腿！然后就被追杀7条街！\n\n## 第五个\n> 某君儿子没考上大学，便找到在国企做董事长的老同学。董事长很爽快：让他来做副总经理吧，月薪五万，每天例行开会就行了。某君：给个一般职位就行了。董事长：做总经理助理吧，月薪2万，给总经理倒倒茶就行了。某君：还是从普通业务员做起吧。董事长：我们的业务员起码要硕士学历，薪水很低，还欠薪！\n\n## 第六个\n> 一女同事和我住同一个小区，有时我蹭她的车，有时她蹭我的车，经常一起回到公司。昨天公司门卫跟我说：“我看到你媳妇在外面搂着个男的。”我知道他误会女同事是我媳妇了，故意逗他说：“她这人就是贪玩，我也管不了。”今天女同事回来，说门卫给了她一朵玫瑰。\n\n## 第七个\n> 一新兵跑步老落后腿。班长问：为何老最后？新兵答：报告班长，吃饭时间只有二分钟，没吃饱跑不动。第二天，班长让新兵吃了个饱。结果那新兵还是跑了个倒数第一。班长问：咋还落后腿。新兵答：报告班长。吃太撑了。\n\n## 第八个\n> 我读小学的时候迟到、逃学、打架什么坏事都干，反正就是一个〝万人嫌〞，所以罚站罚跪就成了家常便饭。每次罚完跪，我都是哭着趴在姐姐背上回家的。有一次姐姐心疼的对我说：小冰呀，你以后还是带着爸爸的护膝上学吧！\n\n## 第九个\n> 我手机背景换了几百次了，老公的依旧是我的大脸照。我说：不会换张美女啊什么的，我不会不开心的？这二货道：这样很好，可以控制玩手机的欲望！\n\n## 第十个\n> 一日，和哥们去一个没去过的地方吃饭，找不到那个地方，看见路边有个协警（背对着），看身材貌似是中年妇女。于是哥们冲过去说道：“阿姨，XXX饭店怎么走。”那个协警黑着脸转过身来，原来是个大叔，但他还是指了路。哥们听完很感激，继续说：“谢谢阿姨……”\n本人一直单身，不知道为什么怎么也找不到对象。最近的几天遇上十年一遇的高温，很让人难受。我们公司的一位漂亮妹纸有天终于热得受不了了。她就问我：你住的那里有空调吗？我：有啊。妹纸：那我以后中午去你那休息，蹭一下空调好不好。我：当然不行，电费这么贵。然后就没有然后了...\n",
            "time": "2019-12-16",
            "bookId": 1
        },
        {
            "id": 3,
            "title": "2019年度最沙雕新闻你觉得是哪一个?",
            "content": "## 2019年度最沙雕新闻你觉得是哪一个?\n> 2019年度最沙雕新闻你觉得是哪一个？ 1 男子带了一顶绿帽去盗窃，帽子上面写的“忘了他吧，我偷电瓶车养你”，最后因为这个帽子太鲜明被警方抓获。男子说买这个帽子是在地摊上看到，觉得很符合自己又穷又没有爱情的心境，没想到电瓶车没偷，女孩也没有跟我走就被抓了。 2 警察抓毒贩时，毒贩正在看以扫毒为主题的电视剧《破冰行动》，网友称电视剧来到现实。后因网络反响强烈，记者追问已被拘捕的毒贩对电视剧的评价，毒贩说主演演得很好。 3 女子收电信诈骗电话，将卡号密码告诉了犯罪分子，银行察觉异常叫了警察，后来警察发现女子因为记性不好给了错误密码而避免了损失。 4 男子报警称自己的山地自行车被偷，民警处理发现这车本来是报警的男子偷来的，被真车主碰上后在警察协助下骑走。警察问报警男子为何自投罗网，偷车男子说骑了一段时间也有感情了。 5 男子和邻居吵架，怕对方人多势众自己吃亏所以报警，民警做笔录发现报警男子是逃犯。 6 男子接到电话称自己被网上追逃，到派出所查询想证明清白，民警一查确为追逃对象将其拘捕。 7 四川南充民警准备抓特大电信诈骗案件嫌疑人，但强行破门有风险，后发现嫌疑人的钥匙插在门锁上忘拔，最后民警顺利破门抓获嫌疑人。 8 两男子凌晨潜入串串店自行搭配锅底偷吃串串，连吃三天后老板才发现店里进贼，第四天两男子来偷吃终于被潜伏民警抓获。 9 小偷入室盗窃，房主年纪大不会用手机报警，小偷：我帮你打110吧。最后被刑拘。 10 成都一女子要跳楼，一男子在对面看热闹不慎失足坠楼死亡，女子看到后觉得太吓人了放弃跳楼。 11 男子报警称被车压到脚，周围多个路人帮忙作证要求车主赔钱。男子善解人意说没啥大事赔5000就行，后来调监控发现是他自己把脚伸车轮下，而且路人都是同伙。",
            "time": "2019-12-16",
            "bookId": 1
        },
        {
            "id": 4,
            "title": "2019年我的美好回忆",
            "content": "## 2019年我的美好回忆\n> 时光匆匆，岁月悠悠，春去冬来，不知不觉，2019年即将过去了，2020年就要到来了。\n回忆即将过去的一年，我有甜、有酸、有苦、也有乐，但所有的甜与酸苦与乐，都在岁月的流逝中化作了醇厚的浓香，令人回味无穷。\n2019，是丰盈而充实的一年，收获了一缕阳光，一股温暖，一片友情。使我的晚年生活更加充实，更加幸福，更加美好。\n\n> 这一年，我怀着一颗热爱美篇的心，虚心学习，努力写作。编写了四十多篇文章和六十多条话题投稿美篇后，有八篇文章被美篇录取加精，有四篇文章被加荐。其中有一篇《我是怎样制作美篇文章的？》文章，被《美篇手册》录取，收录在“美友经验分享区”栏目里，引起了很大的反响，美友阅读量突破46000人，点赞留评人数达到1400多人。\n这一小小的收获，除了自己努力之外，离不开众人的帮助。在这里要感谢美篇平台的支持和关心，感谢《原创笔记》等圈子的帮助和鼓励，特别要感谢美友们的到访与点评。",
            "time": "2019-12-26",
            "bookId": 2
        },
        {
            "id": 5,
            "title": "怎样才能娶到一个好老婆啊",
            "content": "## 怎样才能娶到一个好老婆啊\n> 只要你们感情好。在一起时间长了不会觉得很烦。你爱他。他也爱你。那样生活起来才不会觉得累。那样才会永远相爱一辈子。这才叫娶个好老婆。\n\n> 如果你娶个很贤惠而且什么都好的老婆。你不喜欢她。那日子也不会长久。不会长久的生活还在乎娶什么老婆吗？衷心的祝福你能找到个诚心如意的老婆。男人年轻时，选老婆或选女友，\n第一都是看身材和脸蛋，人品性格和脾气通通不管；到了中年时，才会发现：原来，女人的美，不在外表，而在具有包容心和好脾气的个性，尤其是会撒娇的女人，一旦撒娇撒到男人的死穴，也就是打中了男人心坎里的弱点，这时，就算她要男人去死，男人也会带着微笑和满足的表情从容就义。\n男人要的只是一种类似母爱的包容和关怀，一种无怨无悔、夫唱妇随的契合感觉，我并非把女人当跟班或第二性，也不是歧视女性，真的，男人要的就只是那种即使自己再落魄再倒霉，她也不弃不离的那种生死相随的感动",
            "time": "2019-12-31",
            "bookId": 3
        }
    ]
}